cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
      logMsg("[OTA] Versi ESP32   : " + String(APP_VERSION) + "\n");
      logMsg("[OTA] Versi GitHub  : " + versiDiGitHub + "\n");

      if (versiDiGitHub != APP_VERSION && versiDiGitHub.length() > 0) {
        logMsg("[OTA] >> UPDATE DITEMUKAN! File terbaru tersedia.\n");
        logMsg("[OTA] >> Menyiapkan sistem untuk mengunduh firmware...\n");
        doUpdate = true;
      } else {
        logMsg("[OTA] >> Firmware sudah paling baru. Aman terkendali.\n");
      }
    } else {
      logMsg("[OTA] >> Gagal menghubungi GitHub (HTTP: " + String(httpCode) + "). Periksa koneksi internet.\n");
    }
    http.end();
  }
  
  if (doUpdate) {
    // Jalankan shutdown peripheral & brownout
    prepareForOTA();
    delay(100);

    WiFiClientSecure updateClient;
    updateClient.setInsecure();

    httpUpdate.rebootOnUpdate(true); // Otomatis restart setelah update sukses
    
    t_httpUpdate_return ret = httpUpdate.update(updateClient, urlFirmware);
    
    // Jika baris di bawah tereksekusi, berarti update GAGAL
    restoreAfterOTA();

    if (ret == HTTP_UPDATE_OK) {
      logMsg("\n[OTA] >> UPDATE SUKSES! Board akan restart otomatis.\n");
    } else {
      logMsg("\n[OTA] >> GAGAL UPDATE: " + httpUpdate.getLastErrorString() + " (Code: " + String(httpUpdate.getLastError()) + ")\n");
    }
  }
}

// ========================================================================
// 5. DASHBOARD WEB & API (HTML DENGAN GLASSMORPHISM & AJAX)
// ========================================================================

// Template Web Dashboard di Flash (PROGMEM)
const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="id">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Wanara Seta - Gate Portal</title>
  <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@300;400;600;700&family=JetBrains+Mono:wght@400;700&display=swap" rel="stylesheet">
  <style>
    :root {
      --bg-color: #0d0e15;
      --card-bg: rgba(22, 25, 41, 0.75);
      --border-color: rgba(255, 255, 255, 0.08);
      --text-main: #f3f4f6;
      --text-muted: #9ca3af;
      --primary: #6366f1;
      --primary-hover: #4f46e5;
      --success: #10b981;
      --warning: #f59e0b;
      --danger: #ef4444;
    }
    body {
      margin: 0;
      padding: 0;
      background-color: var(--bg-color);
      background-image: 
        radial-gradient(circle at top right, rgba(99, 102, 241, 0.12), transparent 45%),
        radial-gradient(circle at bottom left, rgba(16, 185, 129, 0.06), transparent 45%);
      color: var(--text-main);
      font-family: 'Outfit', sans-serif;
      min-height: 100vh;
      display: flex;
      justify-content: center;
      align-items: flex-start;
    }
    .app-container {
      width: 100%;
      max-width: 1100px;
      padding: 24px;
      box-sizing: border-box;
    }
    header {
      display: flex;
      justify-content: space-between;
      align-items: center;
      margin-bottom: 24px;
      border-bottom: 1px solid var(--border-color);
      padding-bottom: 16px;
    }
    .brand h1 {
      margin: 0;
      font-size: 22px;
      font-weight: 700;
      letter-spacing: 0.5px;
      background: linear-gradient(135deg, #ffffff 40%, #a5b4fc 100%);
      -webkit-background-clip: text;
      -webkit-text-fill-color: transparent;
    }
    .brand p {
      margin: 4px 0 0 0;
      font-size: 13px;
      color: var(--text-muted);
    }
    .badge-group {
      display: flex;
      gap: 8px;
    }
    .badge {
      padding: 4px 10px;
      border-radius: 9999px;
      font-size: 11px;
      font-weight: 600;
      border: 1px solid rgba(255, 255, 255, 0.1);
      background: rgba(255, 255, 255, 0.05);
    }
    .badge-primary {
      background: rgba(99, 102, 241, 0.15);
      border-color: rgba(99, 102, 241, 0.3);
      color: #a5b4fc;
    }
    .grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(320px, 1fr));
      gap: 20px;
      margin-bottom: 20px;
    }
    .card {
      background: var(--card-bg);
      backdrop-filter: blur(12px);
      -webkit-backdrop-filter: blur(12px);
      border: 1px solid var(--border-color);
      border-radius: 16px;
      padding: 20px;
      box-shadow: 0 8px 32px 0 rgba(0, 0, 0, 0.37);
      transition: transform 0.2s, box-shadow 0.2s;
    }
    .card:hover {
      transform: translateY(-2px);
      box-shadow: 0 12px 40px 0 rgba(0, 0, 0, 0.5);
    }
    .card-title {
      margin: 0 0 16px 0;
      font-size: 15px;
      font-weight: 600;
      display: flex;
      align-items: center;
      gap: 8px;
      color: #ffffff;
      border-bottom: 1px solid rgba(255, 255, 255, 0.06);
      padding-bottom: 8px;
    }
    .card-title svg {
      width: 18px;
      height: 18px;
      color: var(--primary);
      flex-shrink: 0;
    }
    .status-list {
      display: flex;
      flex-direction: column;
      gap: 12px;
    }
    .status-item {
      display: flex;
      justify-content: space-between;
      align-items: center;
      font-size: 13.5px;
    }
    .status-label {
      color: var(--text-muted);
    }
    .status-value {
      font-weight: 600;
      display: flex;
      align-items: center;
      gap: 6px;
    }
    .status-indicator {
      width: 7px;
      height: 7px;
      border-radius: 50%;
      display: inline-block;
    }
    .indicator-green { background-color: var(--success); box-shadow: 0 0 8px var(--success); }
    .indicator-orange { background-color: var(--warning); box-shadow: 0 0 8px var(--warning); }
    .indicator-red { background-color: var(--danger); box-shadow: 0 0 8px var(--danger); }
    .text-green { color: var(--success); }
    .text-orange { color: var(--warning); }
    .text-red { color: var(--danger); }
    .text-muted { color: var(--text-muted); }
    .mono {
      font-family: 'JetBrains Mono', monospace;
      font-size: 12.5px;
      background: rgba(0,0,0,0.3);
      padding: 2px 6px;
      border-radius: 4px;
      color: #e0e7ff;
    }
    .btn {
      background: linear-gradient(135deg, var(--primary), var(--primary-hover));
      color: #ffffff;
      border: none;
      padding: 11px 18px;
      border-radius: 8px;
      font-weight: 600;
      font-size: 13.5px;
      cursor: pointer;
      width: 100%;
      transition: opacity 0.2s, transform 0.1s;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 8px;
      box-sizing: border-box;
      font-family: inherit;
    }
    .btn:hover { opacity: 0.9; }
    .btn:active { transform: scale(0.98); }
    .btn-secondary {
      background: rgba(255, 255, 255, 0.06);
      border: 1px solid rgba(255, 255, 255, 0.08);
      color: var(--text-main);
    }
    .btn-secondary:hover { background: rgba(255, 255, 255, 0.1); }
    .btn-danger { background: linear-gradient(135deg, var(--danger), #be123c); }
    .control-row {
      display: grid;
      grid-template-columns: 1fr 1fr;
      gap: 10px;
      margin-top: 12px;
    }
    .form-group {
      margin-bottom: 12px;
    }
    .form-group label {
      display: block;
      font-size: 11px;
      color: var(--text-muted);
      margin-bottom: 5px;
      font-weight: 600;
      text-transform: uppercase;
      letter-spacing: 0.5px;
    }
    .form-control {
      width: 100%;
      padding: 9px 12px;
      border-radius: 6px;
      background: rgba(0, 0, 0, 0.3);
      border: 1px solid var(--border-color);
      color: #ffffff;
      font-family: inherit;
      font-size: 13px;
      box-sizing: border-box;
    }
    .form-control:focus { outline: none; border-color: var(--primary); }
    select.form-control {
      appearance: none;
      background-image: url("data:image/svg+xml;utf8,<svg fill='white' height='18' viewBox='0 0 24 24' width='18' xmlns='http://www.w3.org/2000/svg'><path d='M7 10l5 5 5-5z'/></svg>");
      background-repeat: no-repeat;
      background-position: right 8px center;
      padding-right: 24px;
    }
    .file-input-wrapper {
      position: relative;
      border: 2px dashed rgba(255, 255, 255, 0.12);
      border-radius: 8px;
      padding: 18px;
      text-align: center;
      background: rgba(0, 0, 0, 0.2);
      cursor: pointer;
    }
    .file-input-wrapper input[type="file"] {
      position: absolute;
      top: 0; left: 0; width: 100%; height: 100%; opacity: 0; cursor: pointer;
    }
    .file-input-text { font-size: 12px; color: var(--text-muted); }
    .progress-container { margin-top: 12px; display: none; }
    .progress-track { background: rgba(0, 0, 0, 0.4); height: 8px; border-radius: 4px; overflow: hidden; border: 1px solid rgba(255,255,255,0.03); }
    .progress-bar { background: linear-gradient(90deg, var(--primary), var(--success)); width: 0%; height: 100%; transition: width 0.1s ease-out; }
    .progress-info { display: flex; justify-content: space-between; font-size: 11px; margin-top: 5px; color: var(--text-muted); }
    
