cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
void handleSaveMqtt() {
  if (server.hasArg("mqtt_server")) {
    mqtt_server    = server.arg("mqtt_server");
    mqtt_port      = server.arg("mqtt_port").toInt();
    mqtt_user      = server.arg("mqtt_user");
    mqtt_pass      = server.arg("mqtt_pass");
    mqtt_client_id = server.arg("mqtt_client_id");

    preferences.begin("gate_config", false);
    preferences.putString("mqtt_server", mqtt_server);
    preferences.putInt("mqtt_port", mqtt_port);
    preferences.putString("mqtt_user", mqtt_user);
    preferences.putString("mqtt_pass", mqtt_pass);
    preferences.putString("mqtt_client_id", mqtt_client_id);
    preferences.end();

    server.send(200, "text/plain", "OK");
    delay(1000);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

void handleTriggerRelay() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  if (server.hasArg("relay")) {
    int rNum = server.arg("relay").toInt();
    if (rNum == 1 || rNum == 2) {
      triggerRelay(rNum);
      server.send(200, "text/plain", "Relay " + String(rNum) + " triggered");
    } else {
      server.send(400, "text/plain", "Invalid relay number");
    }
  } else {
    server.send(400, "text/plain", "Missing parameter");
  }
}

void handleReboot() {
  server.send(200, "text/plain", "Rebooting");
  delay(1000);
  ESP.restart();
}

void handleCekUpdate() {
  String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='2;url=/do_update'><style>body{background:#0b0c10;color:#f3f4f6;text-align:center;padding:50px;font-family:sans-serif;} .loader{border:3px solid rgba(255,255,255,0.08);border-top:3px solid #6366f1;border-radius:50%;width:40px;height:40px;animation:spin 1s linear infinite;margin:20px auto;} @keyframes spin{0%{transform:rotate(0deg);}100%{transform:rotate(360deg);}}</style></head><body><h2>Menghubungi GitHub...</h2><div class='loader'></div><p style='color:#9ca3af;'>Mengunduh manifest pembaruan secara secure...</p></body></html>";
  server.send(200, "text/html", html);
}

void handleDoUpdate() {
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", ""); // Live streaming log

  String htmlStart = R"rawliteral(
  <!DOCTYPE html>
  <html>
  <head>
    <meta charset='UTF-8'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <title>OTA - Wanara Seta</title>
    <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@400;600&family=JetBrains+Mono&display=swap" rel="stylesheet">
    <style>
      body { background: #0b0c10; color: #f3f4f6; font-family: 'Outfit', sans-serif; text-align: center; padding: 40px 20px; margin: 0; }
      .box { max-width: 600px; margin: 0 auto; padding: 30px; background: rgba(22, 25, 41, 0.75); border: 1px solid rgba(255,255,255,0.08); border-radius: 16px; }
      h2 { margin-top: 0; margin-bottom: 20px; font-weight: 600; color: #fff; }
      pre { background: #000; padding: 20px; border: 1px solid rgba(255, 255, 255, 0.05); border-radius: 8px; text-align: left; overflow-x: auto; color: #10b981; font-family: 'JetBrains Mono', monospace; font-size: 12.5px; white-space: pre-wrap; word-wrap: break-word; line-height: 1.5; }
      .btn { display: inline-block; background: linear-gradient(135deg, #6366f1, #4f46e5); color: #fff; padding: 11px 22px; text-decoration: none; border-radius: 6px; font-weight: 600; margin-top: 20px; }
    </style>
  </head>
  <body>
    <div class='box'>
      <h2>Hasil Update OTA GitHub</h2>
      <pre>)rawliteral";

  server.sendContent(htmlStart);
  cekUpdateGitHub(true);
  server.sendContent("</pre><a href='/' class='btn'>KEMBALI KE DASHBOARD</a></div></body></html>");
  server.sendContent("");
}

// Handler POST dari Manual Upload
void handleManualUpdate() {
  server.sendHeader("Connection", "close");
  if (Update.hasError()) {
    server.send(500, "text/plain", String("Upload Error: ") + Update.errorString());
  } else {
    server.send(200, "text/plain", "OK");
    delay(1000);
    ESP.restart();
  }
}

// Handler penulisan chunk file Manual Upload
void handleManualUpload() {
  HTTPUpload& upload = server.upload();
  static bool hasError = false;
  
  if (upload.status == UPLOAD_FILE_START) {
    Serial.printf("[UPLOAD] Mulai upload manual: %s\n", upload.filename.c_str());
    hasError = false;
    
    // Nonaktifkan peripheral dan brownout detector sebelum flashing manual
    prepareForOTA();
    
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
      hasError = true;
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (!hasError) {
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
        hasError = true;
      }
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (!hasError) {
      if (Update.end(true)) {
        Serial.printf("[UPLOAD] Selesai! Ukuran: %u bytes\n", upload.totalSize);
      } else {
        Update.printError(Serial);
        hasError = true;
      }
    }
    // Kembalikan konfigurasi jika update gagal (jika sukses board langsung restart)
    if (hasError) {
      restoreAfterOTA();
    }
  }
}

// ========================================================================
// 6. KONTROL GERBANG & TIMER RELAY
// ========================================================================
void triggerRelay(int relayNum) {
  if (relayNum == 1) {
    isRelay1Active = true;
    relay1ActiveTime = millis();
    digitalWrite(RELAY1_PIN, HIGH);
    Serial.println("[GATE] Relay 1 Aktif (Gerbang Terbuka)");
  } else if (relayNum == 2) {
    isRelay2Active = true;
    relay2ActiveTime = millis();
    digitalWrite(RELAY2_PIN, HIGH);
    Serial.println("[GATE] Relay 2 Aktif (Alarm/Aux Terbuka)");
  }
}

void handleGate() {
  if (isRelay1Active && (millis() - relay1ActiveTime > GATE_OPEN_MS)) {
    isRelay1Active = false;
    digitalWrite(RELAY1_PIN, LOW);
    Serial.println("[GATE] Relay 1 Mati (Gerbang Tertutup)");
  }
  if (isRelay2Active && (millis() - relay2ActiveTime > GATE_OPEN_MS)) {
    isRelay2Active = false;
    digitalWrite(RELAY2_PIN, LOW);
    Serial.println("[GATE] Relay 2 Mati (Alarm/Aux Tertutup)");
  }
}

// ========================================================================
// 7. CALLBACK & KONEKSI MQTT
// ========================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message = "";
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  Serial.printf("\n[MQTT] Pesan masuk di topik: %s\n", topic);
  Serial.println("[MQTT] Payload: " + message);

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, message);
  if (error) {
    Serial.println("[JSON] Gagal mem-parsing payload MQTT.");
    return;
  }

  String topicStr = String(topic);
  String resTopic = "gate/" + mqtt_client_id + "/result";
  String cmdTopic = "gate/" + mqtt_client_id + "/command";

  if (topicStr == resTopic) {
    String status = doc["status"];
    if (status == "valid") {
      Serial.println("[AKSES] Valid! Pesan: " + doc["message"].as<String>());
      triggerRelay(1);
    } else if (status == "invalid") {
      Serial.println("[AKSES] Ditolak! Alasan: " + doc["message"].as<String>());
    }
  } 
  else if (topicStr == cmdTopic) {
    String cmd = doc["command"];
    if (cmd == "open_gate") {
      Serial.println("[COMMAND] Perintah Buka Gerbang Utama!");
      triggerRelay(1);
    } else if (cmd == "open_gate_2") {
      Serial.println("[COMMAND] Perintah Buka Relay 2 / Alarm!");
      triggerRelay(2);
    } else if (cmd == "reboot") {
      Serial.println("[COMMAND] Perintah Reboot dari server. Restarting...");
      esp_task_wdt_delete(NULL); 
      delay(1000);
      ESP.restart();
    }
  }
}

