cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
void reconnectMQTT() {
  Serial.printf("[MQTT] Melakukan koneksi ke broker EMQX %s:%d...\n", mqtt_server.c_str(), mqtt_port);
  
  espClient.setTimeout(1200); 

  if (mqttClient.connect(mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str())) {
    Serial.println("[MQTT] Terhubung!");
    
    String resTopic = "gate/" + mqtt_client_id + "/result";
    String cmdTopic = "gate/" + mqtt_client_id + "/command";
    
    mqttClient.subscribe(resTopic.c_str());
    mqttClient.subscribe(cmdTopic.c_str());
    
    Serial.println("[MQTT] Berhasil subscribe ke topik result & command.");
  } else {
    Serial.print("[MQTT] Gagal terhubung ke broker, rc=");
    Serial.println(mqttClient.state());
  }
}

// ========================================================================
// 8. SETUP & LOOP
// ========================================================================
void setup() {
  Serial.begin(115200);
  delay(1000);

  // Ambil data konfigurasi dari memori internal (NVS)
  preferences.begin("gate_config", true);
  folderAktif    = preferences.getString("ota_folder", "ESP32main");
  savedApSSID    = preferences.getString("ap_ssid", DEFAULT_AP_SSID);
  mqtt_server    = preferences.getString("mqtt_server", mqtt_server);
  mqtt_port      = preferences.getInt("mqtt_port", mqtt_port);
  mqtt_user      = preferences.getString("mqtt_user", mqtt_user);
  mqtt_pass      = preferences.getString("mqtt_pass", mqtt_pass);
  mqtt_client_id = preferences.getString("mqtt_client_id", mqtt_client_id);
  preferences.end();

  // Inisialisasi WiFi Manager
  Serial.println("\n[WIFI] Mencoba terhubung ke jaringan...");
  wm.autoConnect(savedApSSID.c_str(), DEFAULT_AP_PASSWORD);
  Serial.println("[WIFI] Sukses Terhubung! IP Web Dashboard: " + WiFi.localIP().toString());

  // Routing Halaman Web
  server.on("/", handleRoot);
  server.on("/status_data", HTTP_GET, handleStatusData);
  server.on("/save_folder", HTTP_POST, handleSaveFolder);
  server.on("/save_mqtt", HTTP_POST, handleSaveMqtt);
  server.on("/trigger_relay", HTTP_GET, handleTriggerRelay);
  server.on("/reboot", HTTP_GET, handleReboot);
  server.on("/cek_update", HTTP_GET, handleCekUpdate);
  server.on("/do_update", HTTP_GET, handleDoUpdate);
  
  // Handler Upload Manual
  server.on("/update", HTTP_POST, handleManualUpdate, handleManualUpload);

  server.begin();

  // Inisialisasi SPI & RFID MFRC522 (VSPI default)
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI, SS_PIN); 
  mfrc522.PCD_Init();

  // Cek versi sensor saat awal boot
  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  Serial.printf("[RFID] Version Register: 0x%02X\n", v);
  if (v == 0x91 || v == 0x92 || v == 0x88 || v == 0x82 || v == 0x12) {
    rfidStatus = "✅ AKTIF";
    Serial.println("[RFID] Sensor MFRC522 terdeteksi dan siap.");
  } else {
    rfidStatus = "❌ TIDAK MERESPON (Cek Pin/Kabel)";
    Serial.println("[RFID] PERHATIAN: Sensor MFRC522 tidak terdeteksi!");
  }

  // Setup Barcode Scanner (UART2)
  Serial2.begin(BARCODE_BAUD, SERIAL_8N1, BARCODE_RX, BARCODE_TX);
  Serial.println("[BARCODE] Scanner UART2 siap.");

  // Setup MQTT Client
  mqttClient.setServer(mqtt_server.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(1024);        // Buffer JSON MQTT diperbesar

  // Aktifkan Task Watchdog Timer
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  
  esp_task_wdt_add(NULL); 

  // Setup Pin Relay sebagai Output
  pinMode(RELAY1_PIN, OUTPUT);
  pinMode(RELAY2_PIN, OUTPUT);
  digitalWrite(RELAY1_PIN, LOW);
  digitalWrite(RELAY2_PIN, LOW);

  // Cek pembaruan firmware 1x saat booting
  cekUpdateGitHub();
}

void loop() {
  server.handleClient(); // Jaga agar server web tetap responsif
  esp_task_wdt_reset();  // Reset WDT

  // Jaga koneksi MQTT tetap terhubung
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  if (wifiConnected) {
    if (!mqttClient.connected()) {
      if (millis() - lastMqttReconnectAttempt > 5000) {
        lastMqttReconnectAttempt = millis();
        reconnectMQTT();
      }
    } else {
      mqttClient.loop();
    }
  }

  // Logika Pembacaan Barcode (UART2)
  if (Serial2.available()) {
    String barcodeData = Serial2.readStringUntil('\r');
    barcodeData.trim();
    if (barcodeData.length() > 0) {
      Serial.println("[BARCODE] Terdeteksi: " + barcodeData);
      
      if (wifiConnected && mqttClient.connected()) {
        String payload = "{\"barcode\":\"" + barcodeData + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
        String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
        if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
          Serial.println("[MQTT] Barcode sukses terkirim.");
        } else {
          Serial.println("[MQTT] Barcode gagal terkirim!");
        }
      }
    }
  }

  // Logika Pembacaan & Health-Check Sensor RFID
  static unsigned long lastRFIDReadTime = 0;
  static unsigned long lastRfidHealthCheck = 0;

  // Health-check berkala setiap 5 detik
  if (millis() - lastRfidHealthCheck > 5000) {
    lastRfidHealthCheck = millis();
    byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    if (v == 0x00 || v == 0xFF) {
      Serial.println("[RFID] Sensor hang/terputus! Melakukan hard reset...");
      
      // Hardware Reset Pulsa via RST Pin
      digitalWrite(RST_PIN, LOW);
      pinMode(RST_PIN, OUTPUT);
      delay(20);
      digitalWrite(RST_PIN, HIGH);
      delay(50);
      
      // Reset SPI bus
      SPI.end();
      SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI, SS_PIN);
      
      mfrc522.PCD_Init();
      delay(50);
      
      v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
      if (v != 0x00 && v != 0xFF) {
        rfidStatus = "✅ AKTIF (Dipulihkan)";
        Serial.printf("[RFID] Sensor pulih! Versi: 0x%02X\n", v);
      } else {
        rfidStatus = "❌ TIDAK MERESPON (Hang)";
        Serial.println("[RFID] Pemulihan gagal. Cek kabel.");
      }
    } else {
      if (rfidStatus.indexOf("✅") == -1) {
        rfidStatus = "✅ AKTIF";
      }
    }
  }

  // Proses scan kartu RFID
  if (mfrc522.PICC_IsNewCardPresent() && mfrc522.PICC_ReadCardSerial()) {
    String rfidUid = "";
    for (byte i = 0; i < mfrc522.uid.size; i++) {
      rfidUid += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
      rfidUid += String(mfrc522.uid.uidByte[i], HEX);
    }
    rfidUid.toUpperCase();

    unsigned long now = millis();
    
    // Cooldown logic cerdas
    bool isSameCard = (rfidUid == lastScannedUid);
    bool withinSameCardCooldown = (now - lastScannedTime < COOLDOWN_SAME_CARD_MS);
    bool withinAnyCardCooldown = (now - lastScannedTime < COOLDOWN_ANY_CARD_MS);

    if (isSameCard && withinSameCardCooldown) {
      // Abaikan agar tidak terjadi double-scan kartu yang sama
      mfrc522.PICC_HaltA();
      mfrc522.PCD_StopCrypto1();
    } else if (withinAnyCardCooldown) {
      // Abaikan karena terlalu cepat dari scan sebelumnya
      mfrc522.PICC_HaltA();
      mfrc522.PCD_StopCrypto1();
    } else {
      // Proses Validasi Kartu
      lastScannedUid  = rfidUid;
      lastScannedTime = now;
      lastRfidScan    = rfidUid;
      Serial.println("[RFID] Kartu Terdeteksi: " + rfidUid);

      // Bypass jika master card
      if (rfidUid == "A166C820") {
        Serial.println("[MASTER] Master Card terdeteksi! Bypass buka gerbang.");
        triggerRelay(1);
      } else {
        triggerRelay(1); // Buka gerbang utama (LED)
        
        // Kirim data scan ke MQTT Broker
        if (wifiConnected && mqttClient.connected()) {
          String payload = "{\"rfid\":\"" + rfidUid + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
          String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
          if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
            Serial.println("[MQTT] Data scan terkirim ke EMQX.");
          } else {
            Serial.println("[MQTT] Gagal mengirim data scan!");
          }
        } else {
          Serial.println("[MQTT] Offline, data scan tidak dikirim.");
        }
      }

      mfrc522.PICC_HaltA();
      mfrc522.PCD_StopCrypto1();
    }
  }

  // Tangani timer penutupan gerbang otomatis
  handleGate();
}